chore: Remove onnxruntime distribution tarballs and add them to .gitignore.
